           SELECT STK02 ASSIGN TO "stk02.dat"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS WFS-STK02-TICKER
           FILE STATUS IS WS-STATUS-STK02.
