           SELECT STK05 ASSIGN TO "stk05.dat"
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS WFS-STK05-TICKER
           FILE STATUS IS WS-STATUS-STK05.
