           SELECT STK02 ASSIGN TO "stk02.dat"
           ORGANIZATION IS SEQUENTIAL 
           ACCESS MODE IS SEQUENTIAL 
           FILE STATUS IS WS-STATUS-STK02.
