       01 STK02-REGISTER.
           05 WFS-STK02-TICKER           PIC X(10).
           05 WFS-STK02-QTY              PIC 9(06).
           05 WFS-STK02-PMA              PIC 9(04)V99.
           05 WFS-STK02-BALANCE          PIC 9(07)V99.

