       01 STK02-LOCAL-REGISTER.
           03 WS-STK02-TICKER       PIC X(10)     OCCURS 100 TIMES.
           03 WS-STK02-QTY          PIC S9(06)    OCCURS 100 TIMES.
           03 WS-STK02-PRICE        PIC 9(04)V99  OCCURS 100 TIMES.
           03 WS-STK02-BALANCE      PIC S9(07)V99 OCCURS 100 TIMES.
