       01 STK05-REGISTER.
           05 WFS-STK05-TICKER           PIC X(10).
           05 WFS-STK05-QTY              PIC S9(06).
           05 WFS-STK05-PRICE            PIC 9(04)V99.
           05 WFS-STK05-BALANCE          PIC S9(07)V99.

