       01 STK02-REGISTER.
           05 WFS-STK02-TICKER           PIC X(10).
           05 WFS-STK02-QTY              PIC S9(06).
           05 WFS-STK02-PRICE            PIC 9(04)V99.
           05 WFS-STK02-BALANCE          PIC S9(07)V99.

